      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "001-PedeNotaDe0A10".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77 WRK-NUMERO                   PIC X(2) VALUE ZEROS.
       77 WRK-REPETICAO                PIC 9(2) VALUE ZEROS.

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           PERFORM UNTIL WRK-REPETICAO EQUAL 1
               ACCEPT WRK-NUMERO
               IF WRK-NUMERO LESS 0 OR WRK-NUMERO GREATER 10
                   DISPLAY 'Valor invalido, digite novamente'
               END-IF

               IF WRK-NUMERO NOT LESS 0 AND WRK-NUMERO NOT GREATER 10
                   DISPLAY 'Valor valido: ' WRK-NUMERO
                   ADD 1 TO WRK-REPETICAO
               END-IF

           END-PERFORM

           STOP RUN.
