      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "003-QTDAnosIgualar".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77 WRK-A                        PIC 9(6) VALUE 80000.
       77 WRK-B                        PIC 9(6) VALUE 200000.
       77 WRK-REPETICAO                PIC 9(1) VALUE ZEROS.
       77 WRK-CONTADOR                 PIC 9(2) VALUE ZEROS.

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           PERFORM UNTIL WRK-A NOT LESS WRK-B
               MULTIPLY 1.03 BY WRK-A
               MULTIPLY 1.015 BY WRK-B
               ADD 1 TO WRK-CONTADOR
               IF WRK-A EQUAL WRK-B
                   DISPLAY 'Quantidade de anos necessarios: ' WRK-CONTAD
      -            OR
               END-IF

           END-PERFORM

           STOP RUN.
