      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "001-PedeNotaDe0A10".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77 WRK-NUMERO1                  PIC 9(5) VALUE ZEROS.
       77 WRK-SOMA                     PIC 9(5) VALUE ZEROS.
       77 WRK-REPETICAO                PIC 9(1) VALUE ZEROS.
       77 WRK-DIVISAO                  PIC 9(5) VALUE ZEROS.


      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================

           PERFORM UNTIL WRK-REPETICAO EQUAL 5
               ACCEPT WRK-NUMERO1
               ADD WRK-NUMERO1 TO WRK-SOMA
               DIVIDE WRK-SOMA BY 5 GIVING WRK-DIVISAO
               ADD 1 TO WRK-REPETICAO

           END-PERFORM
           DISPLAY 'SOMA: ' WRK-SOMA
           DISPLAY'Divisao: ' WRK-DIVISAO


           STOP RUN.
