      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "006-ImprimNumImp".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77 WRK-NUMERO                   PIC 9(2) VALUE ZEROS.
       77 WRK-REPETICAO                PIC 9(2) VALUE ZEROS.
       77 WRK-RESTO                    PIC 9(2) VALUE ZEROS.
       77 WRK-RESULTADO                PIC 9(2) VALUE ZEROS.

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           PERFORM UNTIL WRK-REPETICAO EQUAL 50
               ADD 1 TO WRK-REPETICAO
               ADD 1 TO WRK-NUMERO
               DIVIDE WRK-NUMERO BY 2 GIVING WRK-RESULTADO
                                      REMAINDER WRK-RESTO
               IF WRK-RESTO EQUAL 1
                   DISPLAY WRK-NUMERO
           END-PERFORM

           STOP RUN.
