      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "004-QuatroNotasExibeMedia!".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.
       77 WRK-PRIMEIRA                        PIC 9(2) VALUE ZEROS.
       77 WRK-SEGUNDA                         PIC 9(2) VALUE ZEROS.
       77 WRK-TERCEIRA                        PIC 9(2) VALUE ZEROS.
       77 WRK-QUARTA                          PIC 9(2) VALUE ZEROS.
       77 WRK-RESULTADO                       PIC 9(2) VALUE ZEROS.

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           ACCEPT WRK-PRIMEIRA
           ACCEPT WRK-SEGUNDA
           ACCEPT WRK-TERCEIRA
           ACCEPT WRK-QUARTA

           COMPUTE WRK-RESULTADO EQUAL (WRK-PRIMEIRA + WRK-SEGUNDA +
      -    WRK-TERCEIRA + WRK-QUARTA) / 4
           DISPLAY 'A MEDIA EH: ' WRK-RESULTADO
           STOP RUN.
