      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "CalculaSalario".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.

       77 WRK-GANHO-HORA                  PIC 9(5) VALUE ZEROS.
       77 WRK-HORAS-TRABALHADAS           PIC 9(5) VALUE ZEROS.
       77 WRK-RESULTADO                   PIC 9(5) VALUE ZEROS.

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           ACCEPT WRK-GANHO-HORA
           ACCEPT WRK-HORAS-TRABALHADAS
           COMPUTE WRK-RESULTADO EQUAL (WRK-HORAS-TRABALHADAS * WRK-GANH
      -    O-HORA)
           DISPLAY 'O salario foi de: ' WRK-RESULTADO

           STOP RUN.
