      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "ConverteMetrosParaCentimetros".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.

       77 WRK-TAMANHO                      PIC 9(6) VALUE ZEROS.
       77 WRK-VELOCIDADE                   PIC 9(4) VALUE ZEROS.
       77 WRK-TEMPO                        PIC 9(6) VALUE ZEROS.

      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           MOVE 15000 TO WRK-TAMANHO
           MOVE 250 TO WRK-VELOCIDADE
           COMPUTE WRK-TEMPO EQUAL WRK-TAMANHO / WRK-VELOCIDADE
           DISPLAY 'O TEMPO ESTIMADO EM SEGUNDOS EH DE: ' WRK-TEMPO
           STOP RUN.
