      *================================================================*
       IDENTIFICATION                                  DIVISION.
      *================================================================*
       PROGRAM-ID. "MultaPescador".
       AUTHOR. "LUCAS KURATA".
      *================================================================*
       ENVIRONMENT                                     DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       CONFIGURATION                          SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.


      *-----------------------------------------------------------------
       INPUT-OUTPUT                           SECTION.
      *=================================================================

      *=================================================================
      *-----------------------------------------------------------------
       FILE-CONTROL.
      *=================================================================
       DATA                                            DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                   SECTION.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       WORKING-STORAGE                     SECTION.

       77 WRK-PESO                PIC 9(5) VALUE ZEROS.
       77 WRK-MULTA               PIC 9(5) VALUE ZEROS.
      *=================================================================
       PROCEDURE                                       DIVISION.
      *=================================================================
           ACCEPT WRK-PESO

           IF WRK-PESO GREATER 50
               DISPLAY 'Peso foi excedido...'
               COMPUTE WRK-PESO EQUAL WRK-PESO - 50
               COMPUTE WRK-MULTA EQUAL WRK-PESO * 4
               DISPLAY 'O valor da multa eh: ' WRK-MULTA
               DISPLAY 'O peso excedido eh: ' WRK-PESO
           ELSE
               DISPLAY 'NAO EXCEDEU O PESO LIMITE'
           END-IF

           STOP RUN.
