       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG34.
      *    PROGRAMA PARA CRIAR ARQUIVO INDEXADO.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

      *    NÃO EXISTE O COMANDO OPTIONAL EM ARQUIVOS INDEXADOS.
           SELECT ARQUIVO-FUNCIONARIO
           ASSIGN TO "funcionarios.dat"
           ORGANIZATION IS INDEXED
           RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.

       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(20).
           05 FUNCINARIO-ENDERECO PIC X(50).
           05 FUNCIONARIO-TELEONE PIC X(15).
           05 FUNCIONARIO-EMAIL PIC X(30).

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.
       PROGRAM-BEGIN.
           OPEN OUTPUT ARQUIVO-FUNCIONARIO.

           CLOSE ARQUIVO-FUNCIONARIO.

       PROGRAM-DONE.
           STOP RUN.
