       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROG36.
      *    PROGRAMA PARA INSERIR DADOS EM ARQUIVO INDEXADO.
      *     WRITE COM INVALID KEY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQUIVO-FUNCIONARIO
           ASSIGN TO "funcionarios.dat"
           ORGANIZATION IS INDEXED
           RECORD KEY IS FUNCIONARIO-CODIGO
           ACCESS MODE IS DYNAMIC.
       DATA DIVISION.
       FILE SECTION.
       FD  ARQUIVO-FUNCIONARIO.
       01  FUNCIONARIO-REGISTRO.
           05 FUNCIONARIO-CODIGO PIC 9(4).
           05 FUNCIONARIO-NOME PIC X(20).
           05 FUNCIONARIO-ENDERECO PIC X(50).
           05 FUNCIONARIO-TELEFONE PIC X(15).
           05 FUNCIONARIO-EMAIL PIC X(30).

       WORKING-STORAGE SECTION.

       77  CONFIRMA-ALTERACAO PIC A(1).
       77  ALTERACAO          PIC 9(1).
       77  MUDANCA            PIC 9(1).
       77  WRK-REPLACE        PIC X(20).
       77  WRK-PEGA-CODIGO    PIC 9(1).
       77  ENCONTRA-REGISTRO  PIC X.


       PROCEDURE DIVISION.
       PROGRA-BEGIN.
           OPEN I-O ARQUIVO-FUNCIONARIO.
           PERFORM PEGA-REGISTRO-FUNCIONARIO.

           PERFORM ALTERAR-REGISTRO
              UNTIL FUNCIONARIO-CODIGO = ZEROES.

           CLOSE ARQUIVO-FUNCIONARIO.
       PROGRAM-DONE.
           STOP RUN.

       PEGA-REGISTRO-FUNCIONARIO.
      *    inicializacao das variaveis.
           MOVE SPACE TO  FUNCIONARIO-REGISTRO.
           MOVE ZEROS TO FUNCIONARIO-CODIGO.
      *    pergunta qual registro deve ser alterado
           DISPLAY "INFORME O CODIGO DO FUNCIONARIO".
           DISPLAY "PARA ALTERAR(1-9999)".
           DISPLAY "DIGITE 0(ZERO) PARA CANCELAR:".
           ACCEPT CODIGO-FUNCIONARIO-ALTERAR.
      *    atribui o codigo fornecido ao registro.
           MOVE CODIGO-FUNCIONARIO-ALTERAR TO  FUNCIONARIO-CODIGO.

           MOVE "N" TO REGISTRO-ENCONTRADO.

           PERFORM ENCONTRA-REGISTRO-FUNCIONARIO
               UNTIL REGISTRO-ENCONTRADO = "S" OR
                     FUNCIONARIO-CODIGO = ZEROES.

       ENCONTRA-REGISTRO-FUNCIONARIO.
           MOVE "S" TO REGISTRO-ENCONTRADO.
           READ ARQUIVO-FUNCIONARIO RECORD
      *    se não encontrar o registro atribui N a REGISTRO-ENCONTRADO
            INVALID KEY
              MOVE "N" TO REGISTRO-ENCONTRADO.

           IF REGISTRO-ENCONTRADO = "N"
               DISPLAY "REGISTRO NAO ENCONTRADO"
               DISPLAY "INFORME O CODIGO DO FUNCIONARIO"
               DISPLAY "PARA ALTERAR(1-9999)"
               DISPLAY "DIGITE 0(ZERO) PARA CANCELAR:"
               ACCEPT CODIGO-FUNCIONARIO-ALTERAR.
           MOVE CODIGO-FUNCIONARIO-ALTERAR TO FUNCIONARIO-CODIGO.

       ALTERAR-REGISTRO.
      *    exibir todos os capos do registro.
           DISPLAY " ".
           DISPLAY "CODIGO: " FUNCIONARIO-CODIGO.
           DISPLAY "1.NOME: " FUNCIONARIO-NOME.
           DISPLAY "2.ENDERECO: " FUNCIONARIO-ENDERECO.
           DISPLAY "3. TELEFONE: " FUNCIONARIO-TELEFONE.
           DISPLAY "4. EMAIL: " FUNCIONARIO-EMAIL.
           DISPLAY " ".
      *    o usuario deve escolher um campo para alterar.
           DISPLAY "DIGITE O NUMERO DO CAMPO".
           DISPLAY "PARA ALTERAR(1-4) OU 0(ZERO) PARA SAIR".
           ACCEPT QUAL-CAMPO.
           IF QUAL-CAMPO > 4
               DISPLAY "CAMPO INVALIDO".

           PERFORM MUDA-E-GRAVA-UM-CAMPO.

           PERFORM PEGA-REGISTRO-FUNCIONARIO.

       MUDA-E-GRAVA-UM-CAMPO.
           IF QUAL-CAMPO = 1
               DISPLAY "INFORME O NOME:"
               ACCEPT FUNCIONARIO-NOME.

           IF QUAL-CAMPO = 2
               DISPLAY "INFORME O ENDERECO"
               ACCEPT FUNCIONARIO-ENDERECO.

           IF QUAL-CAMPO = 3
               DISPLAY "INFORME O TELEFONE"
               ACCEPT FUNCIONARIO-TELEFONE.
           IF QUAL-CAMPO = 4
               DISPLAY "INFORME O EMAIL"
               ACCEPT FUNCIONARIO-EMAIL.

           PERFORM REESCREVER-REGISTRO.

       REESCREVER-REGISTRO.
           REWRITE FUNCIONARIO-REGISTRO
              INVALID KEY
              DISPLAY "ERRO AO REESCREVER O REGSITRO!".
